<?
##############################
######  資料庫主機資訊  ######
##############################
## 主機位址 ##
$dbhost="localhost";

## 資料表名稱 ##
$dbname="mowdSTAT";

## 資料庫帳號 ##
$dbuser="root";

## 資料庫密碼 ##
$dbpass="min";

## 語系檔檔名 ##
$lang="lang_tw.php";

## 自訂資料表前綴字元 ##
$prefix="stat_";

## 計數器程式所在位置，結尾不要加上"/" ##
$locate="http://localhost/mowdSTAT";


##############################
#########  程式設定  #########
##############################
## 管理員密碼 ##
$admin_pw="123456";

## 計數器樣式 ##
## 1=跑馬燈形式 ; 0=圖片
$counter_style="0";

## 啟用來訪頁面統計 ##
## 1=啟用 ; 0=關閉
$enable_refer="1";

## 啟用被訪頁面統計 ##
$enable_visit="1";

## 啟用訪客軟體統計 ##
$enable_software="1";


##############################
########  防灌水裝置  ########
##############################
## 更新資料表的時間，秒為單位 ##
$next=3600;


##############################
#########  HTML設定  #########
##############################
## 網站名稱 ##
$title="我的網站";

## 網站網址 ##
$url="http://localhost";

## 背景圖片 ##
$bgpic="";

## 長條圖-左 ##
$l="images/l.gif";

## 長條圖-中 ##
$m="images/m.gif";

## 長條圖-右 ##
$r="images/r.gif";


##############################
##########  排除設定  ########
##############################
## 接下來設定的項目除了字串過濾
## 符合條件的將不被計數器紀錄


##############################
#########  IP排除設定  #######
##############################
## 排除IP位址 ##
$ignore_ip=array(
"127.0.0.1",
);


##############################
#####  來訪頁面排除設定  #####
##############################
## 字串過濾 ##
## 將網址含有此字串以後的字過濾掉
## 例如:
## http://forum.mowd.idv.tw/site.php?sid=382c487f129c949904aaf56be4692950
## 設定成
## $ignore_refer_word=array(
## "?sid",
## );
## 指定過濾?sid後將會變成
## http://forum.mowd.idv.tw/site.php
## 每個字串必須以"",包住
$ignore_refer_word=array(
"&sid",
"?sid",
);

## 頁面過濾 ##
## 完全包含下列網址的頁面將會不被記錄。請在開頭加上http://
$ignore_refer_page=array(
"http://localhost/index.php",
);

## 網址過濾 ##
## 部分含有以下網址將不被記錄。請在開頭加上http://
$ignore_refer_url=array(
"http://localhost",
);


##############################
#####  被訪頁面排除設定  #####
##############################
##############################
## 字串過濾 ##
$ignore_visit_word=array(
"&sid",
"?sid",
);

## 頁面過濾 ##
$ignore_visit_page=array(
);

## 網址過濾 ##
$ignore_visit_url=array(
"http://localhost/phpbb/posting.php",
);


##############################
#######  以下請勿更改  #######
##############################
$now_version="3.2.0";
?>